# 7.1Handling Missing Data

In [ ]:
#For data with float64 dtype, pandas uses the floating-point value NaN (Not a Number) to represent missing data.
#We call this a sentinel value: when present, it indicates a missing (or null) value

In [4]:
import pandas as pd
import numpy as np

In [5]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [7]:
#The isna method gives us a Boolean Series with True where values are null
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
#Missing data is referred to as NA
#When cleaning up data for analysis, it is often important to do analysis on the missing data itself to identify data
#collection problems or potential biases in the data caused by missing data.
#The built-in Python None value is also treated as NA

string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [9]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [10]:
float_data = pd.Series([1,2,None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [11]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

### Filtering Out Missing Data

In [14]:
#While you always have the option to do it by hand using pandas.isna and Boolean indexing, dropna can be helpful.
#On a Series, it returns the Series with only the nonnull data and index values

data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
#dropna by default drops any row containing a missing value

data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [16]:
#Passing how="all" will drop only rows that are all NA, in this case row 2 will be dropped

data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
#To drop columns in the same way, pass axis="columns"

data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
#Suppose you want to keep only rows containing at most a certain number of missing observations. 
#You can indicate this with the thresh argument

data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(thresh=2)

     0    1    2   4
0  1.0  6.5  3.0 NaN
3  NaN  6.5  3.0 NaN

### Filling in Missing Data

In [23]:
# Calling fillna with a constant replaces missing values with that value:

df = pd.DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -1.243556       NaN       NaN
1  1.050572       NaN       NaN
2 -0.844362       NaN -0.578980
3 -0.606456       NaN -1.000913
4  0.097904  2.507153  2.328086
5 -0.154369  0.405845  2.057767
6 -0.959125 -0.218118 -2.467945

In [24]:
df.fillna(0)

          0         1         2
0 -1.243556  0.000000  0.000000
1  1.050572  0.000000  0.000000
2 -0.844362  0.000000 -0.578980
3 -0.606456  0.000000 -1.000913
4  0.097904  2.507153  2.328086
5 -0.154369  0.405845  2.057767
6 -0.959125 -0.218118 -2.467945

In [25]:
#Calling fillna with a dictionary, you can use a different fill value for each column

df.fillna({1: 99, 2: 0})

          0          1         2
0 -1.243556  99.000000  0.000000
1  1.050572  99.000000  0.000000
2 -0.844362  99.000000 -0.578980
3 -0.606456  99.000000 -1.000913
4  0.097904   2.507153  2.328086
5 -0.154369   0.405845  2.057767
6 -0.959125  -0.218118 -2.467945

In [26]:
#With fillna you can do lots of other things such as simple data imputation using the
#median or mean statistics

data1 = pd.Series([1., np.nan, 3.5, np.nan, 7])
data1.fillna(data1.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation

### Removing Duplicates

In [27]:
data2 = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], "k2": [1, 1, 2, 3, 3, 4, 4]})
data2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [28]:
#Duplicate rows may be found in a DataFrame for any number of reasons. Here is an example.
#The DataFrame method duplicated returns a Boolean Series indicating whether
#each row is a duplicate (its column values are exactly equal to those in an earlier row) or not

data2.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
#'drop_duplicates()' returns a DataFrame with rows where the duplicated array is False filtered out

data2.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
#you can specify any subset of them to detect duplicates. Suppose we had an additional column of
#values and wanted to filter duplicates based only on the "k1" column

data2["v1"] = range(7)
data2

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [32]:
data2.drop_duplicates(subset = ["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
data2.drop_duplicates(["k1", "k2"])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [35]:
#duplicated and drop_duplicates by default keep the first observed value 
#combination. Passing keep="last" will return the last one

data2.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [36]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon","pastrami", "corned beef", "bacon", "pastrami", "honey ham", "nova lox"], 
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [37]:
#Suppose you wanted to add a column indicating the type of animal that each food came from

meat_to_animal = {
 "bacon": "pig",
 "pulled pork": "pig",
 "pastrami": "cow",
 "corned beef": "cow",
 "honey ham": "pig",
 "nova lox": "salmon"
}

In [38]:
#The map method on a Series accepts a function or dictionary-like object containing a mapping to do
#the transformation of values:

data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values

In [39]:
#map can be used to modify a subset of values in an object, 
#but replace provides a simpler and more flexible way to do so

data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [40]:
#The -999 values might be sentinel values for missing data. To replace these with NA
#values that pandas understands, we can use replace, producing a new Series

data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [41]:
#If you want to replace multiple values at once, you instead pass a list and then the substitute value

data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [42]:
#argument passed can also be a dictionary

data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
#The data.replace method is distinct from data.str.replace, which performs element-wise string substitution

### Renaming Axis Indexes

In [44]:
#Like values in a Series, axis labels can be similarly transformed by a function or
#mapping of some form to produce new, differently labeled objects. You can also
#modify the axes in place without creating a new data structure.

data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=["Ohio", "Colorado", "New York"], 
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [45]:
#Like a Series, the axis indexes have a map method

def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [46]:
#You can assign to the index attribute, modifying the DataFrame in place

data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [47]:
#If you want to create a transformed version of a dataset without modifying the original, a useful method is rename

data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [48]:
#rename can be used in conjunction with a dictionary-like object, providing new values for a subset of the axis labels

data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [ ]:
#rename saves you from the chore of copying the DataFrame manually and assigning new values to its index and columns attributes.

### Discretization and Binning

In [49]:
#Continuous data is often discretized or otherwise separated into bins for analysis.
#Suppose you have data about a group of people in a study, and you want to group
#them into discrete age buckets:

ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

bins = [18, 25, 35, 60, 100]

age_categories = pd.cut(ages, bins)

age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [50]:
#The object pandas returns is a special Categorical object. The output you see
#describes the bins computed by pandas.cut. Each bin is identified by a special
#(unique to pandas) interval value type containing the lower and upper limit of each bin:

age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [51]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [52]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [53]:
#Note that pd.value_counts(categories) are the bin counts for the result of pandas.cut

pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [54]:
#In the string representation of an interval, a parenthesis means that the side is open
#(exclusive), while the square bracket means it is closed (inclusive). You can change
#which side is closed by passing right=False:

pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [55]:
#You can override the default interval-based bin labeling by passing a list or array to the labels option:

group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [56]:
#If you pass an integer number of bins to pandas.cut instead of explicit bin edges, it
#will compute equal-length bins based on the minimum and maximum values in the data. 
#Consider the case of some uniformly distributed data chopped into fourths

data = np.random.uniform(size=20)

pd.cut(data, 4, precision=2)

#The precision=2 option limits the decimal precision to two digits

[(0.55, 0.77], (0.77, 0.99], (0.55, 0.77], (0.11, 0.33], (0.55, 0.77], ..., (0.77, 0.99], (0.55, 0.77], (0.33, 0.55], (0.11, 0.33], (0.11, 0.33]]
Length: 20
Categories (4, interval[float64, right]): [(0.11, 0.33] < (0.33, 0.55] < (0.55, 0.77] < (0.77, 0.99]]

In [59]:
#A closely related function, 'pandas.qcut()', bins the data based on sample quantiles.
#Depending on the distribution of the data, using pandas.cut will not usually result
#in each bin having the same number of data points. Since pandas.qcut uses sample
#quantiles instead, you will obtain roughly equally sized bins:

data = np.random.standard_normal(1000)

quartiles = pd.qcut(data, 4, precision=2)
quartiles

[(0.75, 2.95], (0.017, 0.75], (-2.9899999999999998, -0.67], (0.017, 0.75], (-2.9899999999999998, -0.67], ..., (-2.9899999999999998, -0.67], (0.017, 0.75], (0.017, 0.75], (0.75, 2.95], (0.75, 2.95]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.9899999999999998, -0.67] < (-0.67, 0.017] < (0.017, 0.75] < (0.75, 2.95]]

In [60]:
 pd.value_counts(quartiles)

(-2.9899999999999998, -0.67]    250
(-0.67, 0.017]                  250
(0.017, 0.75]                   250
(0.75, 2.95]                    250
dtype: int64

In [61]:
#Similar to pandas.cut, you can pass your own quantiles (numbers between 0 and 1, inclusive):

pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-2.981, -1.368]    100
(-1.368, 0.0172]    400
(0.0172, 1.351]     400
(1.351, 2.948]      100
dtype: int64

### Detecting and Filtering Outliers

In [65]:
#Filtering or transforming outliers is largely a matter of applying array operations.

data = pd.DataFrame(np.random.standard_normal((1000, 4)))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.025040    -0.046844     0.031176     0.013145
std       0.985039     0.982048     1.033223     1.006634
min      -2.764984    -3.394688    -3.533521    -3.490204
25%      -0.689913    -0.725021    -0.691487    -0.669045
50%      -0.001776    -0.017354     0.009186     0.004021
75%       0.669141     0.607841     0.751438     0.742016
max       3.037234     3.427291     3.795147     3.568089

In [66]:
#Suppose you wanted to find values in one of the columns exceeding 3 in absolute value:

col = data[2]

col[col.abs() > 3]

158    3.795147
493   -3.222833
561   -3.533521
635    3.155580
Name: 2, dtype: float64

In [67]:
#To select all rows having a value exceeding 3 or 3, you can use the any method on a
#Boolean DataFrame:

data[(data.abs() > 3).any(axis="columns")]

#The parentheses around data.abs() > 3 are necessary in order to call the any method on the result of the comparison operation

            0         1         2         3
155  0.215696 -2.378401  1.802738  3.568089
158  0.886562  0.502642  3.795147 -0.075207
183 -0.387216 -3.109109 -0.879745 -0.581576
414 -1.296220 -3.394688  0.286685 -0.596643
493 -0.196735 -0.227562 -3.222833  2.322841
561  1.166597 -0.416419 -3.533521 -0.608247
595  1.043466  3.427291 -0.897113 -1.483292
635  0.627459 -0.284530  3.155580  0.833173
702 -0.669385 -0.305854 -0.671653 -3.490204
872  3.037234  0.069145 -0.398388  0.132954
904 -1.139996  0.859934 -0.830138 -3.104629
934  1.453013 -3.237874 -0.092217  1.010492

In [68]:
#Values can be set based on these criteria. Here is code to cap values outside the interval 3 to 3

data[data.abs() > 3] = np.sign(data) * 3

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.025078    -0.046530     0.030981     0.013172
std       0.984923     0.978274     1.027773     1.002872
min      -2.764984    -3.000000    -3.000000    -3.000000
25%      -0.689913    -0.725021    -0.691487    -0.669045
50%      -0.001776    -0.017354     0.009186     0.004021
75%       0.669141     0.607841     0.751438     0.742016
max       3.000000     3.000000     3.000000     3.000000

In [69]:
#The statement np.sign(data) produces 1 and 1 values based on whether the values in data are positive or negative:

np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2 -1.0 -1.0  1.0 -1.0
3  1.0  1.0 -1.0 -1.0
4 -1.0  1.0  1.0 -1.0

### Permutation and Random Sampling

In [70]:
#Permuting (randomly reordering) a Series or the rows in a DataFrame is possible
#using the numpy.random.permutation function. Calling permutation with the length
#of the axis you want to permute produces an array of integers indicating the new ordering

df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [71]:
sampler = np.random.permutation(5)
sampler

array([0, 1, 2, 3, 4])

In [72]:
# That array can then be used in iloc-based indexing or the equivalent 'take()' function

df.take(sampler)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [73]:
df.iloc[sampler]

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [74]:
#By invoking take with axis="columns", we could also select a permutation of the columns:

column_sampler = np.random.permutation(7)
column_sampler

array([2, 6, 1, 3, 4, 5, 0])

In [75]:
df.take(column_sampler, axis="columns")

    2   6   1   3   4   5   0
0   2   6   1   3   4   5   0
1   9  13   8  10  11  12   7
2  16  20  15  17  18  19  14
3  23  27  22  24  25  26  21
4  30  34  29  31  32  33  28

In [76]:
#To select a random subset without replacement (the same row cannot appear twice),
#you can use the sample method on Series and DataFrame:

df.sample(n=3)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34

In [77]:
#To generate a sample with replacement (to allow repeat choices), pass replace=True to sample:

choices = pd.Series([5, 7, -1, 6, 4])

choices.sample(n=10, replace=True)

4    4
1    7
1    7
3    6
2   -1
2   -1
4    4
1    7
1    7
2   -1
dtype: int64

### Computing Indicator/Dummy Variables

In [79]:
#Another type of transformation for statistical modeling or machine learning applications 
# is converting a categorical variable into a dummy or indicator matrix. If a column in 
# a DataFrame has k distinct values, you would derive a matrix or DataFrame
# with k columns containing all 1s and 0s. pandas has a pandas.get_dummies function
# for doing this, though you could also devise one yourself

df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"], "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [80]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [81]:
#you may want to add a prefix to the columns in the indicator DataFrame, 
#which can then be merged with the other data. pandas.get_dummies has a prefix argument for doing this

dummies = pd.get_dummies(df["key"], prefix="key")

df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
#If a row in a DataFrame belongs to multiple categories, we have to use a different approach to create the dummy variables

mnames = ["movie_id", "title", "genres"]

movies = pd.read_table("datasets/movielens/movies.dat", sep="::",header=None, names=mnames, engine="python")
movies[:10]

>>> ............................

#pandas has implemented a special Series method str.get_dummies that handles this scenario of 
#multiple group membership encoded as a delimited string

dummies = movies["genres"].str.get_dummies("|")

dummies.iloc[:10, :6]

>>> .............................

# Then, as before, you can combine this with movies while adding a "Genre_" to the
# column names in the dummies DataFrame with the add_prefix method

movies_windic = movies.join(dummies.add_prefix("Genre_"))

movies_windic.iloc[0]

>>> .............................

In [83]:
#A useful recipe for statistical applications is to combine pandas.get_dummies with a discretization function like pandas.cut

np.random.seed(12345) #to make example repeatable

values = np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [84]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 7.3 Extension Data Types

In [85]:
# More recently, pandas has developed an extension type system allowing for new data
# types to be added even if they are not supported natively by NumPy. 
# These new data types can be treated as first class alongside data coming from NumPy arrays

In [86]:
s = pd.Series([1, 2, 3, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [87]:
#Mainly for backward compatibility reasons, Series uses the legacy behavior of using a float64 data type and 
#np.nan for the missing value. We could create this Series instead using 'pandas.Int64Dtype()'

s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [88]:
s.dtype

Int64Dtype()

In [89]:
#short hand that also works:
s = pd.Series([1, 2, 3, None], dtype="Int64")

In [90]:
#pandas also has an extension type specialized for string data that does not use NumPy object arrays

s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [91]:
#These string arrays generally use much less memory and are frequently computationally more
#efficient for doing operations on large datasets

In [92]:
# Extension types can be passed to the Series astype method, allowing you to convert easily as 
# part of your data cleaning process

df = pd.DataFrame({"A": [1, 2, None, 4], "B": ["one", "two", "three", None], "C": [False, None, False, True]})
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [93]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

# 7.4 String Manipulation

### Python Built-in String Object Methods

In [2]:
# In many string munging and scripting applications, built-in string methods are sufficient.
# As an example, a comma-separated string can be broken into pieces with 'split()'':

val = "a,b, guido"

val.split(",")

['a', 'b', ' guido']

In [3]:
# split is often combined with strip to trim whitespace (including line breaks):

pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [4]:
# These substrings could be concatenated together with a two-colon delimiter using addition

first, second, third = pieces

first + "::" + second + "::" + third

'a::b::guido'

In [5]:
# this isnt a practical generic method. A faster and more Pythonic way is to pass a
# list or tuple to the join method on the string "::":

"::".join(pieces)

'a::b::guido'

In [6]:
# Note that the difference between find and index is that index raises an exception if
# the string isnt found (versus returning 1):

val.index(":")

ValueError: substring not found

In [7]:
# Relatedly, count returns the number of occurrences of a particular substring:

val.count(",")

2

In [8]:
# replace will substitute occurrences of one pattern for another. 
#It is commonly used to delete patterns, too, by passing an empty string

val.replace(",", "::")

'a::b:: guido'

In [9]:
val.replace(",", "")

'ab guido'

### Regular Expressions

In [11]:
# Pythons built-in re module is responsible for applying regular expressions to strings.
# The re module functions fall into three categories: pattern matching, substitution,and splitting.
# Naturally these are all related; a regex describes a pattern to locate in the text, which can then be used for many purposes

# suppose we wanted to split a string with a variable number of whitespace characters
# The regex describing one or more whitespace characters is '\s+':

import re

text = "foo   bar\t baz  \tqux"

re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [13]:
# When you call 're.split(r"\s+", text)', the regular expression is first compiled, and
# then its split method is called on the passed text. You can compile the regex yourself
# with 're.compile()', forming a reusable regex object:

regex = re.compile(r"\s+")

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [14]:
# If, instead, you wanted to get a list of all patterns matching the regex, you can use the
# 'findall()' method:

regex.findall(text)

['   ', '\t ', '  \t']

In [15]:
# Creating a regex object with re.compile is highly recommended if you intend to 
# apply the same expression to many strings; doing so will save CPU cycles

# match and search are closely related to findall. While findall returns all matches
# in a string, search returns only the first match. More rigidly, match only matches at
# the beginning of the string. As a less trivial example, lets consider a block of text and
# a regular expression capable of identifying most email addresses:

text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""

pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive

regex = re.compile(pattern, flags=re.IGNORECASE)

In [17]:
# Using findall() on the text produces a list of the email addresses:

regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [19]:
# search() returns a special match object for the first email address in the text. For the preceding regex,
# the match object can only tell us the start and end position of the pattern in the string:

m = regex.search(text)
m

In [20]:
text[m.start():m.end()]

'dave@google.com'

In [21]:
print(regex.match(text))

None

In [22]:
# regex.match returns None, as it will match only if the pattern occurs at the start of the string

# Relatedly, sub() will return a new string with occurrences of the pattern replaced by a new string:

print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [23]:
# Suppose you wanted to find email addresses and simultaneously segment each
# address into its three components: username, domain name, and domain suffix.
# to do this, put parentheses around the parts of the pattern to segment:

pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

regex = re.compile(pattern, flags = re.IGNORECASE)

m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [24]:
# A match object produced by this modified regex returns a tuple of the pattern
# components with its groups() method

# findall returns a list of tuples when the pattern has groups:

regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [25]:
# sub also has access to groups in each match using special symbols like \1 and \2.
# The symbol \1 corresponds to the first matched group, \2 corresponds to the second, and so forth:

print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### String Functions in pandas

In [29]:
import pandas as pd
import numpy as np

In [31]:
# Cleaning up a messy dataset for analysis often requires a lot of string manipulation.
# To complicate matters, a column containing strings will sometimes have missing data:

data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}

data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [32]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [33]:
# String and regular expression methods can be applied (passing a lambda or other function) 
# to each value using data.map, but it will fail on the NA (null) values.
# To cope with this, Series has array-oriented methods for string operations that skip over and propagate NA values.
# These are accessed through Seriess str attribute;
# for example, we could check whether each email address has "gmail" in it with str.contains()

data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [34]:
# Note that the result of this operation has an object dtype. pandas has extension types
# that provide for specialized treatment of strings, integers, and Boolean data which
# until recently have had some rough edges when working with missing data:

data_as_string_ext = data.astype('string')
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [37]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [38]:
# Regular expressions can be used, too, along with any 're' options like IGNORECASE

pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [39]:
# There are a couple of ways to do vectorized element retrieval. Either use str.get or index into the str attribute

matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [40]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [41]:
# You can similarly slice strings using this syntax:

data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [42]:
# The str.extract method will return the captured groups of a regular expression as a DataFrame:

data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

# 7.5 Categorical Data

### Background and Motivation

In [43]:
# Frequently, a column in a table may contain repeated instances of a smaller set of
# distinct values. We have already seen functions like unique and value_counts, which
# enable us to extract the distinct values from an array and compute their frequencies, respectively

values = pd.Series(['apple', 'orange', 'apple', 'apple'] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [44]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [45]:
pd.value_counts(values)

apple     6
orange    2
dtype: int64

In [46]:
# Many data systems (for data warehousing, statistical computing, or other uses) have
# developed specialized approaches for representing data with repeated values for more
# efficient storage and computation. In data warehousing, a best practice is to use
# so-called dimension tables containing the distinct values and storing the primary
# observations as integer keys referencing the dimension table

values = pd.Series([0, 1, 0, 0] * 2)

dim = pd.Series(['apple', 'orange'])

values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [47]:
dim

0     apple
1    orange
dtype: object

In [48]:
# We can use the take method to restore the original Series of strings:

dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [ ]:
# This representation as integers is called the categorical or dictionary-encoded representation.
# The array of distinct values can be called the categories, dictionary, or levels of the data.

# The integer values that reference the categories are called the category codes or simply codes.

### Categeorical Extension Type in pandas

In [50]:
# pandas has a special Categorical extension type for holding data that uses the
# integer-based categorical representation or encoding. This is a popular data compres sion technique for 
# data with many occurrences of similar values and can provide
# significantly faster performance with lower memory use, especially for string data.

fruits = ['apple', 'orange', 'apple', 'apple'] * 2

N = len(fruits)

rng = np.random.default_rng(seed = 12345)

df = pd.DataFrame({'fruit': fruits,'basket_id': np.arange(N), 
                   'count': rng.integers(3, 15, size=N), 
                   'weight': rng.uniform(0, 4, size=N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [51]:
# Here, df['fruit'] is an array of Python string objects. We can convert it to categorical by calling:

fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [53]:
# The values for fruit_cat are now an instance of pandas.Categorical, which you can access via the .array attribute:

c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical